<template>
    <div id="index">
        <div class="r_main_content">
            <div class="r_head">开发概述</div>
            <p>微信公众平台是运营者通过公众号为微信用户提供资讯和服务的平台，而公众平台开发接口则是提供服务的基础，开发者在公众平台网站中创建公众号、获取接口权限后，可以通过阅读本接口文档来帮助开发。</p>
            <p>为了识别用户，每个用户针对每个公众号会产生一个安全的OpenID，如果需要在多公众号、移动应用之间做用户共通，则需前往微信开放平台，将这些公众号和应用绑定到一个开放平台账号下，绑定后，一个用户虽然对多个公众号和应用有多个不同的OpenID，但他对所有这些同一开放平台账号下的公众号和应用，只有一个UnionID，可以在用户管理-获取用户基本信息（UnionID机制）文档了解详情。</p>
            <p>请开发者注意：</p>
            <div class="info">
                <p>1、微信公众平台开发是指为微信公众号进行业务开发，为移动应用、PC端网站、公众号第三方平台（为各行各业公众号运营者提供服务）的开发，请前往微信开放平台接入。</p>
                <p>2、在申请到认证公众号之前，你可以先通过测试号申请系统，快速申请一个接口测试号，立即开始接口测试开发。</p>
                <p>3、在开发过程中，可以使用接口调试工具来在线调试某些接口。</p>
                <p>4、每个接口都有每日接口调用频次限制，可以在公众平台官网-开发者中心处查看具体频次。</p>
                <p>5、在开发出现问题时，可以通过接口调用的返回码，以及报警排查指引（在公众平台官网-开发者中心处可以设置接口报警），来发现和解决问题。</p>
                <p>6、公众平台以access_token为接口调用凭据，来调用接口，所有接口的调用需要先获取access_token，access_token在2小时内有效，过期需要重新获取，但1天内获取次数有限，开发者需自行存储，详见获取接口调用凭据（access_token）文档。</p>
                <p>7、公众平台接口调用仅支持80端口。</p>
            </div>
            <p>公众号主要通过公众号消息会话和公众号内网页来为用户提供服务的，下面分别介绍这两种情况：</p>
            <div class="bold_head">1、公众号消息会话</div>
            <p>公众号是以微信用户的一个联系人形式存在的，消息会话是公众号与用户交互的基础。目前公众号内主要有这样几类消息服务的类型，分别用于不同的场景。</p>
            <div class="info">
                <p>1）群发消息：公众号可以以一定频次（订阅号为每天1次，服务号为每月4次），向用户群发消息，包括文字消息、图文消息、图片、视频、语音等。</p>
                <p>2）被动回复消息：在用户给公众号发消息后，微信服务器会将消息发到开发者预先在开发者中心设置的服务器地址（开发者需要进行消息真实性验证），公众号可以在5秒内做出回复，可以回复一个消息，也可以回复命令告诉微信服务器这条消息暂不回复。被动回复消息可以设置加密（在公众平台官网的开发者中心处设置，设置后，按照消息加解密文档来进行处理。其他3种消息的调用因为是API调用而不是对请求的返回，所以不需要加解密）。</p>
                <p>3）客服消息：在用户给公众号发消息后的48小时内，公众号可以给用户发送不限数量的消息，主要用于客服场景。用户的行为会触发事件推送，某些事件推送是支持公众号据此发送客服消息的，详见微信推送消息与事件说明文档。</p>
                <p>4）模板消息：在需要对用户发送服务通知（如刷卡提醒、服务预约成功通知等）时，公众号可以用特定内容模板，主动向用户发送消息。</p>
            </div>
        </div>
    </div>
</template>

<script>
export default {

}
</script>

<style>
.r_main_content {
    width: 80%;
    margin: 0 auto;
    color: #333F5C;
    font-size: 0.2rem; /* 默认字体 */
}

.r_head {
    font-size: 0.3rem;
    margin-top: 0.5rem;
    margin-bottom: 0.5rem;
    border-bottom: 0.01rem solid #e9e9e9;
    padding-bottom: 0.4rem; 
    text-align: left; 
}

.r_main_content p {
    font-size: 0.2rem;
    text-align: left;
    line-height: 0.35rem;
}

.r_main_content .info {
    padding: 0.2rem 0.5rem; 
    background: #f5f5f5;
}

.r_main_content .bold_head {
    text-align: left;
    font-weight: 900;
    font-size: 0.22rem;
}
</style>


